[
	{
		"bookId": 1,
		"bookName": "Refactoring UI",
		"author": "Adam Wathan",
		"image": "https://i.ibb.co.com/sdhJTptT/refactoring-ui.jpg",
		"review": "'Refactoring UI' is a design book for developers who want to create visually appealing interfaces. It teaches core design principles like spacing, color, typography, and visual hierarchy. The book uses real-world examples and before-after comparisons to show practical improvements. Tailwind CSS is used throughout, making it ideal for modern web devs. Adam Wathan and Steve Schoger simplify design decisions with actionable tips. It focuses on why certain UI tweaks work, not just how to do them. This book helps non-designers build polished, user-friendly apps.",
		"totalPages": 218,
		"rating": 4.6,
		"category": "Technology",
		"tags": ["UI / UX", "Web Development"],
		"publisher": "Refactoring UI",
		"yearOfPublishing": 2018
	},
	{
		"bookId": 2,
		"bookName": "The Great Gatsby",
		"author": "F. Scott Fitzgerald",
		"image": "https://i.ibb.co.com/KPPcL67/great-gatsby.jpg",
		"review": "Set in 1920s America, this novel follows the mysterious millionaire Jay Gatsby. He throws lavish parties hoping to win back his lost love, Daisy Buchanan. Narrated by Nick Carraway, the story explores illusion, wealth, and longing. F. Scott Fitzgerald critiques the American Dream through Gatsby's tragic pursuit. The writing is lyrical, symbolic, and emotionally powerful. Themes include social class, identity, and disillusionment. It's considered one of the greatest novels in American literature.",
		"totalPages": 208,
		"rating": 4.1,
		"category": "Fiction",
		"tags": ["Romance", "Emotion"],
		"publisher": "Charles Scribner's Sons",
		"yearOfPublishing": 1925
	},
	{
		"bookId": 3,
		"bookName": "Code: 2nd Edition",
		"author": "Charles Petzold",
		"image": "https://i.ibb.co.com/KcTgxJ7Y/code-second-edition.jpg",
		"review": "This book explores the fundamental building blocks of computers from the ground up. Charles Petzold takes readers through circuits, switches, binary, and machine code. It shows how simple logic leads to powerful computing systems. The writing is accessible even for non-tech readers, using real-life analogies. It connects everyday concepts to computing history and hardware. Ideal for programmers who want deeper understanding of what happens under the hood. It's a classic that explains computers like no other book does.",
		"totalPages": 480,
		"rating": 4.8,
		"category": "Technology",
		"tags": ["Technology", "Computer"],
		"publisher": "Microsoft Press",
		"yearOfPublishing": 2022
	},
	{
		"bookId": 4,
		"bookName": "365 Tales from Islam",
		"author": "Ziya Us Salam",
		"image": "https://i.ibb.co.com/GvxMp1KC/365-tales-from-islam.jpg",
		"review": "This book offers a daily collection of short Islamic stories for all ages. Each tale teaches moral lessons such as honesty, patience, and gratitude. The stories are rooted in Islamic history, Quranic verses, and the lives of prophets. It's written in a simple, engaging style for kids and families. The book helps reinforce Islamic values in everyday life. Readers can reflect and learn through one meaningful story per day. It promotes character development and spiritual growth.",
		"totalPages": 236,
		"rating": 4.5,
		"category": "Islamic",
		"tags": ["Spiritual Growth", "Self-Help"],
		"publisher": "OM Books International",
		"yearOfPublishing": 2019
	},
	{
		"bookId": 5,
		"bookName": "Atomic Habits",
		"author": "James Clear",
		"image": "https://i.ibb.co.com/3YQxV0rj/atomic-habits.jpg",
		"review": "James Clear explains how small habits compound into major life changes. The book breaks down how to build good habits and eliminate bad ones. It focuses on systems rather than goals, promoting sustainable progress. Clear introduces the 4 Laws of Behavior Change for practical action. Scientific research and real-life examples back every concept. It emphasizes identity-based habits for lasting transformation. Atomic Habits is a top pick for anyone seeking personal growth and consistency.",
		"totalPages": 320,
		"rating": 4.7,
		"category": "Self Help",
		"tags": ["Habits", "Self-Growth"],
		"publisher": "Penguin Random House",
		"yearOfPublishing": 2018
	},
	{
		"bookId": 6,
		"bookName": "A History of the Ottoman Empire",
		"author": "Douglas A. Howard",
		"image": "https://i.ibb.co.com/dsZ11PDB/history-of-the-ottoman-empire.jpg",
		"review": "Douglas A. Howard presents a detailed account of the Ottoman Empire's rise and fall. The book spans over six centuries of political, cultural, and military history. It covers the sultans, bureaucracy, wars, and global influence. The writing combines narrative storytelling with scholarly analysis. It emphasizes both internal dynamics and interactions with the wider world. Suitable for students, history lovers, or researchers. This book offers a rich, comprehensive look at one of history's great empires.",
		"totalPages": 412,
		"rating": 4.2,
		"category": "History",
		"tags": ["Islamic", "Empire", "War"],
		"publisher": "Cambridge University Press",
		"yearOfPublishing": 2017
	},
	{
		"bookId": 7,
		"bookName": "The Power of Discipline",
		"author": "Daniel Walter",
		"image": "https://i.ibb.co.com/v4dNWhZc/the-power-of-discipline.jpg",
		"review": "Daniel Walter explores how discipline is the key to achieving goals. He explains the psychology behind self-control and habit formation. The book includes mental frameworks to overcome procrastination and distractions. Practical tips like visualization, time-blocking, and mindset shifts are included. It motivates readers to stay committed even when motivation fades. Discipline is presented as a trainable skill, not a fixed trait. The Power of Discipline is a motivational toolkit for long-term success.",
		"totalPages": 134,
		"rating": 4.6,
		"category": "Self Help",
		"tags": ["Self-Discipline", "Success"],
		"publisher": "Daniel Walter",
		"yearOfPublishing": 2020
	},
	{
		"bookId": 8,
		"bookName": "A Journey through a History of Magic",
		"author": "J.K. Rowling",
		"image": "https://i.ibb.co.com/ynphGB2D/harry-potter-journey-through-history-of-magic.jpg",
		"review": "This companion book to the British Library exhibition explores magical history and lore. It connects real-world myths and folklore with the Harry Potter universe. The book includes sketches, notes, and drafts from J.K. Rowling herself. Historical artifacts and illustrations add depth to the wizarding world. It blends fiction with cultural and magical traditions from around the globe. Great for fans curious about the origins of magical concepts. It's educational, artistic, and full of behind-the-scenes magic.",
		"totalPages": 144,
		"rating": 4.6,
		"category": "Fantasy",
		"tags": ["Magic", "Adventure", "Fiction"],
		"publisher": "The British Library",
		"yearOfPublishing": 2017
	},
	{
		"bookId": 9,
		"bookName": "Harry Potter and the Cursed Child",
		"author": "J.K. Rowling",
		"image": "https://i.ibb.co.com/qM1bw4dh/harry-potter-and-cursed-child.jpg",
		"review": "This is a stage play script set 19 years after the original Harry Potter series. It follows Harry's son, Albus Severus Potter, as he struggles with family legacy. Albus and Scorpius Malfoy travel through time using a Time-Turner. Their actions alter past events and create dark alternate realities. The story explores themes of friendship, identity, and redemption. While not written by J.K. Rowling alone, it is considered part of the official canon. Fans get a mix of nostalgia and new magical drama.",
		"totalPages": 336,
		"rating": 4.8,
		"category": "Fantasy",
		"tags": ["Magic", "Adventure", "Fiction"],
		"publisher": "Little, Brown",
		"yearOfPublishing": 2016
	},
	{
		"bookId": 10,
		"bookName": "The Kubernetes Book",
		"author": "Nigel Poulton",
		"image": "https://i.ibb.co.com/fzg9zMp9/kubernetes-book.jpg",
		"review": "This book is a beginner-to-intermediate guide to Kubernetes, the popular container orchestration platform. It explains key concepts like Pods, Deployments, Services, and Ingress. The author, Nigel Poulton, provides practical hands-on examples and CLI usage. Readers learn how to build, deploy, scale, and manage containerized apps. It's updated regularly to reflect changes in the Kubernetes ecosystem. Great for developers, DevOps engineers, or anyone entering cloud-native environments. The book simplifies complex topics and helps you gain real-world confidence.",
		"totalPages": 384,
		"rating": 4.5,
		"category": "Technology",
		"tags": ["Technology", "Automation"],
		"publisher": "O'Reilly Media",
		"yearOfPublishing": 2017
	},
	{
		"bookId": 11,
		"bookName": "Harry Potter: Dark Arts",
		"author": "Jody Revenson",
		"image": "https://i.ibb.co.com/Fk9tSstt/harry-potter-dark-arts.jpg",
		"review": "This book explores the sinister side of the wizarding world, from curses to dark creatures. It dives into characters like Voldemort, Bellatrix, and the Death Eaters. The content includes concept art, behind-the-scenes images, and film details. It's part of the 'Wizarding World' companion series, focused on darker themes. Perfect for fans interested in the mythology of evil magic. It shows how the dark arts influenced both story and movie production. A visually rich and eerie collector's item for Potterheads.",
		"totalPages": 192,
		"rating": 4.7,
		"category": "Fantasy",
		"tags": ["Magic", "Adventure", "Fiction"],
		"publisher": "Insight Editions",
		"yearOfPublishing": 2020
	},
	{
		"bookId": 12,
		"bookName": "Fantastic Beasts and Where to Find Them",
		"author": "J.K. Rowling",
		"image": "https://i.ibb.co.com/bjJRdWyj/fantastic-beasts-and-where-to-find-them.jpg",
		"review": "Written as a fictional textbook by Newt Scamander, this book catalogs magical creatures. It features descriptions of beasts like Nifflers, Bowtruckles, and Thunderbirds. Originally a Hogwarts school book, it expands J.K. Rowling's magical universe. The real-world edition includes witty annotations by Harry, Ron, and Hermione. It's both a whimsical bestiary and a world-building masterpiece. Later adapted into a film series with Newt as the protagonist. A must-read for fans who love magical zoology and lore.",
		"totalPages": 128,
		"rating": 4.4,
		"category": "Fantasy",
		"tags": ["Magic", "Adventure", "Fiction"],
		"publisher": "Bloomsburry",
		"yearOfPublishing": 2017
	}
]
